{"format": "layers-model", "generatedBy": "keras v3.4.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.4.1", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 62, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 64, 64, 3]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of110.bin", "group1-shard2of110.bin", "group1-shard3of110.bin", "group1-shard4of110.bin", "group1-shard5of110.bin", "group1-shard6of110.bin", "group1-shard7of110.bin", "group1-shard8of110.bin", "group1-shard9of110.bin", "group1-shard10of110.bin", "group1-shard11of110.bin", "group1-shard12of110.bin", "group1-shard13of110.bin", "group1-shard14of110.bin", "group1-shard15of110.bin", "group1-shard16of110.bin", "group1-shard17of110.bin", "group1-shard18of110.bin", "group1-shard19of110.bin", "group1-shard20of110.bin", "group1-shard21of110.bin", "group1-shard22of110.bin", "group1-shard23of110.bin", "group1-shard24of110.bin", "group1-shard25of110.bin", "group1-shard26of110.bin", "group1-shard27of110.bin", "group1-shard28of110.bin", "group1-shard29of110.bin", "group1-shard30of110.bin", "group1-shard31of110.bin", "group1-shard32of110.bin", "group1-shard33of110.bin", "group1-shard34of110.bin", "group1-shard35of110.bin", "group1-shard36of110.bin", "group1-shard37of110.bin", "group1-shard38of110.bin", "group1-shard39of110.bin", "group1-shard40of110.bin", "group1-shard41of110.bin", "group1-shard42of110.bin", "group1-shard43of110.bin", "group1-shard44of110.bin", "group1-shard45of110.bin", "group1-shard46of110.bin", "group1-shard47of110.bin", "group1-shard48of110.bin", "group1-shard49of110.bin", "group1-shard50of110.bin", "group1-shard51of110.bin", "group1-shard52of110.bin", "group1-shard53of110.bin", "group1-shard54of110.bin", "group1-shard55of110.bin", "group1-shard56of110.bin", "group1-shard57of110.bin", "group1-shard58of110.bin", "group1-shard59of110.bin", "group1-shard60of110.bin", "group1-shard61of110.bin", "group1-shard62of110.bin", "group1-shard63of110.bin", "group1-shard64of110.bin", "group1-shard65of110.bin", "group1-shard66of110.bin", "group1-shard67of110.bin", "group1-shard68of110.bin", "group1-shard69of110.bin", "group1-shard70of110.bin", "group1-shard71of110.bin", "group1-shard72of110.bin", "group1-shard73of110.bin", "group1-shard74of110.bin", "group1-shard75of110.bin", "group1-shard76of110.bin", "group1-shard77of110.bin", "group1-shard78of110.bin", "group1-shard79of110.bin", "group1-shard80of110.bin", "group1-shard81of110.bin", "group1-shard82of110.bin", "group1-shard83of110.bin", "group1-shard84of110.bin", "group1-shard85of110.bin", "group1-shard86of110.bin", "group1-shard87of110.bin", "group1-shard88of110.bin", "group1-shard89of110.bin", "group1-shard90of110.bin", "group1-shard91of110.bin", "group1-shard92of110.bin", "group1-shard93of110.bin", "group1-shard94of110.bin", "group1-shard95of110.bin", "group1-shard96of110.bin", "group1-shard97of110.bin", "group1-shard98of110.bin", "group1-shard99of110.bin", "group1-shard100of110.bin", "group1-shard101of110.bin", "group1-shard102of110.bin", "group1-shard103of110.bin", "group1-shard104of110.bin", "group1-shard105of110.bin", "group1-shard106of110.bin", "group1-shard107of110.bin", "group1-shard108of110.bin", "group1-shard109of110.bin", "group1-shard110of110.bin"], "weights": [{"name": "sequential/conv2d/kernel", "shape": [5, 5, 3, 512], "dtype": "float32"}, {"name": "sequential/conv2d/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [1843200, 62], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [62], "dtype": "float32"}]}]}